saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKL03Z4_DFP.10.0.1.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <vendor>NXP</vendor>
  <name>MKL03Z4_DFP</name>
  <description>Device Family Pack for MKL03Z4</description>
  <license>Licenses.txt</license>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <releases>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Device Startup</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKL03Z4" Dvendor="NXP:11">
      <description>The Kinetis(r) KL03 chip-scale package (CSP) MCU offers the world's smallest ARM Powered(r) microcontroller, designed to support the latest innovation in smart, small devices.

- Allows designers to dramatically reduce their board size without compromising performance, feature integration or power consumption of end products
- Consumes 35 percent less PCB area, while delivering 60 percent more GPIO than the nearest competitor
- Features security circuitry to prevent unauthorized access to RAM and flash contents
- Supported by low-power, cost effective development platform for quick application prototyping and demonstration
&amp;lt;/ul&amp;gt;</description>
      <device Dname="MKL03Z16xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL03Z16xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x4000" startup="1" default="1"/>
        <memory name="SRAM" access="rw" start="0x1ffffe00" size="0x0800" default="1"/>
        <algorithm name="arm/MK_P16_48MHZ_KL03.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>
        <debug svd="MKL03Z4.xml"/>
        <variant Dvariant="MKL03Z16VFG4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z16VFG4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z16VFG4/MKL03Z16xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL03Z16VFK4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z16VFK4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z16VFK4/MKL03Z16xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKL03Z32xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL03Z32xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x8000" startup="1" default="1"/>
        <memory name="SRAM" access="rw" start="0x1ffffe00" size="0x0800" default="1"/>
        <algorithm name="arm/MK_P32_48MHZ_KL03.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>
        <debug svd="MKL03Z4.xml"/>
        <variant Dvariant="MKL03Z32CAF4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z32CAF4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z32CAF4/MKL03Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL03Z32VFG4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z32VFG4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z32VFG4/MKL03Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL03Z32VFK4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z32VFK4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z32VFK4/MKL03Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKL03Z8xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL03Z8xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x2000" startup="1" default="1"/>
        <memory name="SRAM" access="rw" start="0x1ffffe00" size="0x0800" default="1"/>
        <algorithm name="arm/MK_P8_48MHZ_KL03.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>
        <debug svd="MKL03Z4.xml"/>
        <variant Dvariant="MKL03Z8VFG4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z8VFG4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z8VFG4/MKL03Z8xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL03Z8VFK4">
          <compile header="fsl_device_registers.h" define="CPU_MKL03Z8VFK4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL03Z8VFK4/MKL03Z8xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="MKL03Z16???4" Dvendor="NXP:11"/>
      <accept Dname="MKL03Z32???4" Dvendor="NXP:11"/>
      <accept Dname="MKL03Z8???4" Dvendor="NXP:11"/>
    </condition>
