saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKL03Z4_DFP.10.0.1.pdsc
    <condition id="devices.MKL03Z16xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
    </condition>
    <condition id="devices.MKL03Z32xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
    </condition>
    <condition id="devices.MKL03Z8xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MKL03Z4_platform.Include_core_cm0plus">
      <description></description>
      <files>
        <file name="arm/startup_MKL03Z4.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MKL03Z4.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MKL03Z4.h" category="header" attr="config"/>
        <file name="MKL03Z4_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MKL03Z16xxx4_flash.scf" category="linkerScript" condition="devices.MKL03Z16xxx4_mdk" attr="config"/>
        <file name="arm/MKL03Z16xxx4_ram.scf" category="linkerScript" condition="devices.MKL03Z16xxx4_mdk" attr="config"/>
        <file name="arm/MKL03Z32xxx4_flash.scf" category="linkerScript" condition="devices.MKL03Z32xxx4_mdk" attr="config"/>
        <file name="arm/MKL03Z32xxx4_ram.scf" category="linkerScript" condition="devices.MKL03Z32xxx4_mdk" attr="config"/>
        <file name="arm/MKL03Z8xxx4_flash.scf" category="linkerScript" condition="devices.MKL03Z8xxx4_mdk" attr="config"/>
        <file name="arm/MKL03Z8xxx4_ram.scf" category="linkerScript" condition="devices.MKL03Z8xxx4_mdk" attr="config"/>
        <file name="iar/MKL03Z16xxx4_flash.icf" category="linkerScript" condition="devices.MKL03Z16xxx4_iar" attr="config"/>
        <file name="iar/MKL03Z16xxx4_ram.icf" category="linkerScript" condition="devices.MKL03Z16xxx4_iar" attr="config"/>
        <file name="iar/MKL03Z32xxx4_flash.icf" category="linkerScript" condition="devices.MKL03Z32xxx4_iar" attr="config"/>
        <file name="iar/MKL03Z32xxx4_ram.icf" category="linkerScript" condition="devices.MKL03Z32xxx4_iar" attr="config"/>
        <file name="iar/MKL03Z8xxx4_flash.icf" category="linkerScript" condition="devices.MKL03Z8xxx4_iar" attr="config"/>
        <file name="iar/MKL03Z8xxx4_ram.icf" category="linkerScript" condition="devices.MKL03Z8xxx4_iar" attr="config"/>
        <file name="system_MKL03Z4.c" category="sourceC" attr="config"/>
        <file name="system_MKL03Z4.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MKL03Z4" isDefaultVariant="1" condition="devices.MKL03Z4_device.MKL03Z4_device.MKL03Z4_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.lpuart_driver.port_driver.smc_utility_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.1" Csub="i2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MKL03Z4_driver.i2c">
      <description>I2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_i2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_i2c_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="lpuart_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MKL03Z4_driver.lpuart">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_lpuart_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_lpuart_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="spi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MKL03Z4_driver.spi">
      <description>SPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_spi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_spi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="adc" condition="device.MKL03Z4_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file name="drivers/fsl_adc16.c" category="sourceC"/>
        <file name="drivers/fsl_adc16.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="clock" condition="device.MKL03Z4_driver.common">
      <description>Clock Driver</description>
      <files>
        <file name="drivers/fsl_clock.c" category="sourceC"/>
        <file name="drivers/fsl_clock.h" category="header"/>
      </files>
    </component>
